000001190307     A          R RECORD1
000002190307     A                                  2  4USER
000100190307     A                                  2 28'PAYROLL PROGRAM COMPLETED'
000101190307     A                                  2 66DATE EDTCDE(Y)
000102190307     A                                  3  4'GAYEON KO'
000103190307     A                                  7 10'RATES: '
000104190307     A                                  7 19'DAY RATE: '
000105190307     A            DAYRATE        5  2   7 37EDTCDE(1)
000106190307     A                                  8 19'AFTERNOON RATE: '
000107190307     A            AFTNRATE       5  2   8 37EDTCDE(1)
000108190307     A                                  9 19'NIGHT RATE: '
000109190307     A            NIGHTRATE      5  2   9 37EDTCDE(1)
000110190307     A                                 11 11'TOTALS: '
000111190307     A                                 13 19'REGULAR PAY: '
000112190307     A            TOTREGPAY      9Y 2O 13 37EDTCDE(1)
000113190307     A                                 14 19'OVERTIME PAY: '
000114190307     A            TOTOVTPAY      9Y 2O 14 37EDTCDE(1)
000115190307     A                                 15 19'COMPANY PAYOUT: '
000116190307     A            TOTEMPPAY      9Y 2O 15 37EDTCDE(1)
000117190307
000118190307
000119190307
000120190307
000121190307
000122190307
000123190307
000124190307
000125190307
000126190307
000127190307
000128190307
000129190307
000130190307
000131190307
000132190307
000133190307
000134190307
000135190307
000136190307
000137190307
000138190307
000139190307
000140190307
000141190307
000142190307
000143190307
000144190307
000145190307
000146190307
000147190307
000148190307
000149190307
000150190307
000151190307
000152190307
000153190307
000154190307
000155190307
000156190307
000157190307
000158190307
000159190307
000160190307
000161190307
000162190307
000163190307
000164190307
000165190307
000166190307
