000109190307     FSHIFTRATESIF   E             DISK    RENAME(SHIFTRATES:SHIFTRATER)
000111190307     FALLSHIFT  IF   E           K DISK    RENAME(ALLSHIFT:ALLSHIFTR)
000112190307     FCONFIRMPAYCF   E             WORKSTN
000113190307     FPAYRPT    O    E             PRINTER OFLIND(*IN01)
000114190307     DHOURSOVER        S              3  0
000115190307
000116190307/FREE
000117190307       READ SHIFTRATES;
000118190307       WRITE TITLE;
000119190307       WRITE COLHDG;
000120190307       READ ALLSHIFT;
000121190307
000122190307       DOW NOT %EOF;
000123190307         EXSR PAYSR;
000124190307
000125190307         IF *IN01;
000126190307           WRITE TITLE;
000127190307           WRITE COLHDG;
000128190307           *IN01 = *OFF;
000129190307         ENDIF;
000130190307
000131190307         WRITE EMPDETAIL;
000132190307         READ ALLSHIFT;
000133190307
000134190307       ENDDO;
000135190307
000136190307       TOTEMPPAY = TOTREGPAY + TOTOVTPAY;
000137190307       WRITE TOTALS;
000138190307       EXFMT RECORD1;
000139190307       *INLR = *ON;
000140190307       RETURN;
000141190307
000142190307       //************** SUBROUTIN **************//
000143190307       BEGSR PAYSR;
000144190307
000145190307         SELECT;
000146190307           WHEN WORKSHIFT = 'D';
000147190307             HOURLYRATE = DAYRATE;
000148190307           WHEN WORKSHIFT = 'N';
000149190307             HOURLYRATE = NIGHTRATE;
000150190307           WHEN WORKSHIFT = 'A';
000151190307             HOURLYRATE = AFTNRATE;
000152190307         ENDSL;
000153190307
000154190307         SELECT;
000155190307           WHEN PAYGRADE = '1';
000156190307             EVAL(H) HOURLYRATE *= 1.073;
000157190307           WHEN PAYGRADE = '2';
000158190307             EVAL(H) HOURLYRATE *= 1.054;
000159190307           WHEN PAYGRADE = '3';
000160190307             EVAL(H) HOURLYRATE *= 0.955;
000161190307         ENDSL;
000162190307
000163190307         HOURSOVER = HRSWORKED - 40;
000164190307
000165190307         SELECT;
000166190307           WHEN (HOURSOVER > 0);
000167190307             REGULARPAY = 40 * HOURLYRATE;
000168190307             EVAL(H) OVERPAY = HOURSOVER * HOURLYRATE * 1.5;
000169190307             TOTREGPAY += REGULARPAY;
000170190307             TOTOVTPAY += OVERPAY;
000171190307           OTHER;
000172190307             REGULARPAY = HRSWORKED * HOURLYRATE;
000173190307             OVERPAY = 0;
000174190307             TOTREGPAY += REGULARPAY;
000175190307         ENDSL;
000176190307
000177190307         TOTALPAY = REGULARPAY + OVERPAY;
000178190307
000179190307       ENDSR;
000180190307
000181190307
000182190307
000183190307
000184190307
000185190307
000186190307
000187190307
000188190307
000189190307
000190190307
000191190307
000192190307
000193190307
000194190307
000195190307
000196190307
000197190307
000198190307
000199190307
000200190307
000201190307
000202190307
000203190307
000204190307
000205190307
000206190307
000207190307
000208190307
000209190307
000210190307
000211190307
000212190307
000213190307
000214190307
000215190307
000216190307
000217190307
000218190307
000219190307
000220190307
000221190307
000222190307
000223190307
