000001190311     A          R RECORD1
000002190311     A                                  2  4USER
000003190311     A                                  2 28'PAYROLL PROGRAM COMPLETED'
000004190311     A                                  2 66DATE EDTCDE(Y)
000005190311     A                                  3  4'GAYEON KO'
000006190311     A                                  5 10'RATES:                            '
000007190311     A                                  6 19'DAY RATE: '
000008190311     A            DAYRATE        5  2   6 37EDTCDE(1)
000009190311     A                                  7 19'AFTERNOON RATE: '
000010190311     A            AFTNRATE       5  2   7 37EDTCDE(1)
000011190311     A                                  8 19'NIGHT RATE: '
000012190311     A            NIGHTRATE      5  2   8 37EDTCDE(1)
000013190311     A                                 11 11'TOTALS: '
000014190311     A                                 13 19'REGULAR PAY: '
000015190311     A            TOTREGPAY      9Y 2O 13 37EDTCDE(1)
000016190311     A                                 14 19'OVERTIME PAY: '
000017190311     A            TOTOVTPAY      9Y 2O 14 37EDTCDE(1)
000018190311     A                                 15 19'COMPANY PAYOUT: '
000019190311     A            TOTEMPPAY      9Y 2O 15 37EDTCDE(1)
000020190311     A            SHIFTTYPE     30   O 10 25
000021190311
000022190311
000023190311
000024190311
000025190311
000026190311
000027190311
000028190311
000029190311
000030190311
000031190311
000032190311
000033190311
000034190311
000035190311
000036190311
000037190311
000038190311
000039190311
000040190311
000041190311
000042190311
000043190311
000044190311
000045190311
000046190311
000047190311
000048190311
000049190311
000050190311
000051190311
000052190311
000053190311
000054190311
000055190311
000056190311
000057190311
000058190311
000059190311
000060190311
000061190311
000062190311
000063190311
000064190311
000065190311
000066190311
000067190311
000068190311
000069190311
000070190311
