000100190321     A          R ALLSHIFT                  PFILE(SENECAPAY/ALLSHIFT)
000101190321     A          K EMPNUM
000102190321     A          S WORKSHIFT                 COMP(EQ 'N')
