000100190311     FSHIFTRATESIF   E             DISK    RENAME(SHIFTRATES:SHIFTRATER)
000101190311     FALLSHIFT  IF   E           K DISK    RENAME(ALLSHIFT:ALLSHIFTR)
000102190311     FCONFIRMPY2CF   E             WORKSTN
000103190311     FPAYRPT2   O    E             PRINTER OFLIND(*IN01)
000104190321     D MAIN            PR                  EXTPGM('PAROLLPG2')
000105190321     D  SHIFTTYPE                    30
000106190321     D MAIN            PI
000107190321     D  SHIFTTYPE                    30
000108190321     D  HOURSOVER      S              3  0
000111190311
000112190311/FREE
000113190311       READ SHIFTRATES;
000114190311       WRITE TITLE;
000115190311       WRITE COLHDG;
000116190311       READ ALLSHIFT;
000117190311
000118190311       DOW NOT %EOF;
000119190311         EXSR PAYSR;
000120190311
000121190311         IF *IN01;
000122190311           WRITE TITLE;
000123190311           WRITE COLHDG;
000124190311           *IN01 = *OFF;
000125190311         ENDIF;
000126190311
000127190311         WRITE EMPDETAIL;
000128190311         READ ALLSHIFT;
000129190311
000130190311       ENDDO;
000131190311
000132190311       TOTEMPPAY = TOTREGPAY + TOTOVTPAY;
000133190311       WRITE TOTALS;
000134190311       EXFMT RECORD1;
000135190311       *INLR = *ON;
000136190311       RETURN;
000137190311
000138190311       //************** SUBROUTIN **************//
000139190311       BEGSR PAYSR;
000140190311
000141190311         SELECT;
000142190311           WHEN WORKSHIFT = 'D';
000143190311             HOURLYRATE = DAYRATE;
000144190311           WHEN WORKSHIFT = 'N';
000145190311             HOURLYRATE = NIGHTRATE;
000146190311           WHEN WORKSHIFT = 'A';
000147190311             HOURLYRATE = AFTNRATE;
000148190311         ENDSL;
000149190311
000150190311         SELECT;
000151190311           WHEN PAYGRADE = '1';
000152190311             EVAL(H) HOURLYRATE *= 1.073;
000153190311           WHEN PAYGRADE = '2';
000154190311             EVAL(H) HOURLYRATE *= 1.054;
000155190311           WHEN PAYGRADE = '3';
000156190311             EVAL(H) HOURLYRATE *= 0.955;
000157190311         ENDSL;
000158190311
000159190311         HOURSOVER = HRSWORKED - 40;
000160190311
000161190311         SELECT;
000162190311           WHEN (HOURSOVER > 0);
000163190311             REGULARPAY = 40 * HOURLYRATE;
000164190311             EVAL(H) OVERPAY = HOURSOVER * HOURLYRATE * 1.5;
000165190311             TOTREGPAY += REGULARPAY;
000166190311             TOTOVTPAY += OVERPAY;
000167190311           OTHER;
000168190311             REGULARPAY = HRSWORKED * HOURLYRATE;
000169190311             OVERPAY = 0;
000170190311             TOTREGPAY += REGULARPAY;
000171190311         ENDSL;
000172190311
000173190311         TOTALPAY = REGULARPAY + OVERPAY;
000174190311
000175190311       ENDSR;
000176190311
000177190311
000178190311
000179190311
000180190311
000181190311
000182190311
000183190311
000184190311
000185190311
000186190311
000187190311
000188190311
000189190311
000190190311
000191190311
000192190311
000193190311
000194190311
000195190311
000196190311
000197190311
000198190311
000199190311
000200190311
000201190311
000202190311
000203190311
000204190311
000205190311
000206190311
000207190311
000208190311
000209190311
000210190311
000211190311
000212190311
000213190311
000214190311
000215190311
000216190311
000217190311
000218190311
000219190311
