000100190407     FHWYTOLLDSPCF   E             WORKSTN
000101190409     FTOLLCUST  UF   E           K DISK    RENAME(TOLLCUST:TOLLCUSTR)
000103190409     FTOLLS     IF   E             DISK    RENAME(TOLLS:TOLLSR)
000104190407     FTOLLREPORTO    E             PRINTER OFLIND(*IN01)
000105190409
000106190409     D MAIN            PR                  EXTPGM('HWYTOLLS')
000107190409     D  DATEIN                         D
000108190409     D MAIN            PI
000109190409     D  DATEIN                         D
000110190409
000111190409     DENTRYEXITFEE     S              2  0
000112190407     DTOLLRATE         S              5  4
000113190409     DTOLLCHARGE       S              5  2
000114190407
000116190407/FREE
000117190409
000118190407       WRITE  HEADINGS;
000119190407       READ   TOLLS;
000120190407
000121190409      //************** MAIN ROUTIN **************//
000122190409
000123190407       DOW   NOT %EOF;
000124190409             IF ENTRYDATE = DATEIN;
000125190409               EXSR PRCESSCUST;
000126190409             ENDIF;
000158190407             READ TOLLS;
000159190407       ENDDO;
000160190409
000161190407       WRITE TOTALS; // REPORT
000162190407       EXFMT RECORD1; //EXECUTE DISPLAY FILE
000163190409
000164190407       *INLR = *ON;  // LAST RECORD INDICATOR, MUST BE SET *ON AT THE END
000165190407       RETURN;
000166190407
000167190409
000168190409
000169190407       //************** SUBROUTIN **************//
000170190409       BEGSR PRCESSCUST;          // 1 SUBROUTINE
000196190407         SELECT;
000197190409           WHEN VEHIC00001 = 'L';
000198190407             EXSR LIGHTVEHICLE;
000199190409           WHEN VEHIC00001 = 'H';
000200190407             EXSR HEAVYVEHICLE;
000201190409           WHEN VEHIC00001 = 'M' ;
000202190407             EXSR MULTVEHICLE;
000203190407         ENDSL;
000207190409
000208190409         TOLLCHARGE = KILOMETERS * TOLLRATE;
000209190409         IF TRANS00001 = 'N' ;  // SET TRANS00001, NOTRANSP
000210190409            NOTRANSP = 4.07;
000211190409         ELSE;
000212190409            NOTRANSP = 0;
000213190409         ENDIF;
000214190409
000215190409         TOTALDUE = TOLLCHARGE + NOTRANSP + ENTRYEXITFEE;
000216190409         FINALTOTAL = FINALTOTAL +TOTALDUE;
000218190409
000228190409         CHAIN PLATE TOLLCUST;
000229190409           IF %FOUND;
000230190409             FOUNDTOT = FOUNDTOT + 1;
000231190409             FULLNAME = %TRIM(FIRSTNAME) + ' ' + LASTNAME;
000232190409             VTYPE = VEHIC00001;
000233190409             TOTALOWING = TOTALOWING + TOTALDUE;
000234190409             UPDATE TOLLCUSTR;
000235190409           ELSE;
000236190409             UNKNOWNTOT = UNKNOWNTOT + 1;
000237190409             FULLNAME = 'CUSTOMER NOT ON FILE';
000239190409             TOTALOWING = TOTALDUE;
000240190409           ENDIF;
000241190409
000242190409           IF *IN01;
000243190409             WRITE HEADINGS;
000244190409             *IN01 = *OFF;
000245190409           ENDIF;
000246190409
000247190409           WRITE DETAIL;
000248190407       ENDSR;
000249190407
000250190409
000251190407       BEGSR LIGHTVEHICLE;         // 2-1 SUBROUTINE
000252190407         SELECT;
000253190407           WHEN ENTRYHOUR >= 19 OR ENTRYHOUR < 6;
000254190407             TOLLRATE = 0.2162;
000255190407           WHEN ENTRYHOUR >= 16;
000256190407             TOLLRATE = 0.3842;
000257190407           WHEN ENTRYHOUR >= 10;
000258190407             TOLLRATE = 0.2833;
000259190407           WHEN ENTRYHOUR >= 9;
000260190407             TOLLRATE = 0.3259;
000261190407           WHEN ENTRYHOUR >= 6;
000262190407             TOLLRATE = 0.3707;
000263190407         ENDSL;
000264190407       ENDSR;
000265190407
000266190407       BEGSR HEAVYVEHICLE;        // 2-2 SUBROUTINE
000267190407         SELECT;
000268190407            WHEN ENTRYHOUR >= 19 OR ENTRYHOUR < 6;
000269190407             TOLLRATE = 0.4324;
000270190407           WHEN ENTRYHOUR >= 16;
000271190407             TOLLRATE = 0.7683;
000272190407           WHEN ENTRYHOUR >= 10;
000273190407             TOLLRATE = 0.5666;
000274190407           WHEN ENTRYHOUR >= 9;
000275190407             TOLLRATE = 0.6518;
000276190407           WHEN ENTRYHOUR >= 6;
000277190407             TOLLRATE = 0.7418;
000278190407         ENDSL;
000279190407       ENDSR;
000280190407
000281190407       BEGSR MULTVEHICLE;         //2-3 SUBROUTINE
000282190407         SELECT;
000283190407           WHEN ENTRYHOUR >= 19 OR ENTRYHOUR < 6;
000284190407             TOLLRATE = 0.6786;
000285190407           WHEN ENTRYHOUR >= 16;
000286190407             TOLLRATE = 1.1525;
000287190407           WHEN ENTRYHOUR >= 10;
000288190407             TOLLRATE = 0.8499;
000289190407           WHEN ENTRYHOUR >= 9;
000290190407             TOLLRATE = 0.9778;
000291190407           WHEN ENTRYHOUR >= 6;
000292190407             TOLLRATE = 1.1122;
000293190407         ENDSL;
000294190407       ENDSR;
000295190407
000296190407
000297190407
000298190407
